{
  "A central high-variance burst pattern characterized by a near-vertical rise to peaks typically around 4–5, followed by a return toward baseline. The burst can vary in duration and internal complexity, from short and simple with few sub-peaks to extended with dense fluctuations and multiple sub-clusters.": "common feature",
  "In most series, the transition onset varies in timing, often occurring in the central portion of the series.": "common feature",
  "Within-burst fluctuations during the high-variance regime can include high-frequency noise and multiple sub-peaks, forming a nested or multi-scale burst structure in many cases, though simpler burst interiors with moderate fluctuations are also consistent with class 1.": "common feature",
  "Post-transition dynamics often include a multi-phase return to baseline, such as a noisy plateau with small fluctuations around 0–1, distinct from the baseline and initial spike, with persistent jitter and quasi-periodic oscillations in many series; however, some series may exhibit a simpler decay without extensive jitter or multi-phase behavior.": "common feature",
  "Pre-transition micro-oscillations: small amplitude fluctuations in the baseline just before the major transition may occur in some series, signaling pre-burst activity, but their absence does not rule out class 1.": "common feature",
  "Transient high-magnitude bursts during the transition, with peaks reaching roughly 4–5, occurring irregularly across the series, and featuring fluctuations that can range from sparse to dense within-burst variations.": "common feature",
  "Bursts within the transition can appear as multiple sub-clusters with brief inter-cluster dips, forming a nested multi-scale burst pattern in many series, though not all samples display this level of complexity.": "common feature",
  "In some series, transition timing falls in the central portion, implying a common triggering window for those samples.": "partial-sample feature",
  "Two-stage post-transition pattern: a high-variance mid-level plateau (roughly 1–3) followed by a lower-variance plateau near 0–1 before returning to baseline.": "partial-sample feature",
  "Late-stage residual plateau: a small, short-lived plateau near 0–0.5 just before the final drop to baseline, creating a two-step endfade.": "partial-sample feature",
  "Burst clustering: spikes occur in tight clusters within the transition window, not as solitary events, forming dense burst groups.": "partial-sample feature",
  "Post-peak undershoot: after the spike cluster, the signal briefly dips below the subsequent plateau before stabilizing.": "partial-sample feature",
  "After the peak, the signal decays in two clear steps, creating distinct plateaus around 1–3 and then near 0 before final return to baseline.": "partial-sample feature",
  "The rise to the peak is almost vertical, while the fall is multi-step with several plateaus and dips, indicating contour asymmetry.": "partial-sample feature",
  "A faint pre-transition micro-oscillation exists in the baseline just before the major burst in some series, signaling small pre-burst fluctuations.": "partial-sample feature",
  "Post-transition jitter persists after the main drop as low-amplitude, quasi-periodic oscillations up to near the final zero, not just random noise.": "partial-sample feature",
  "Late-end spike: a small, brief spike near the very end of the series just before the final return to baseline.": "partial-sample feature",
  "Nested burst structure: transition bursts contain secondary mini-clusters with brief inter-subcluster dips, indicating multi-scale burst organization.": "partial-sample feature",
  "Mid-transition dwell: there are sustained plateaus around 2–3 within the transition window, not only spikes, suggesting temporary stabilization during surge.": "partial-sample feature",
  "Quasi-periodic micro-oscillation: during high-value bursts, small-amplitude oscillations repeat with a roughly constant period across images.": "partial-sample feature",
  "Intermittent zero resets in surge: the transition window includes brief returns to exactly zero before spikes resume.": "partial-sample feature",
  "Variability in feature presence: not all series exhibit every described feature; the central high-variance burst is the primary indicator for class 1, while micro-structures such as pre-burst oscillations, nested burst patterns, or multi-phase post-transition dynamics are supportive but not mandatory for classification.": "partial-sample feature"
}