{
"Sharp mid-series transition to a sustained flat regime, creating a two-level overall pattern with a clear level change around one-third to one-half of the series."                      : "partial-sample feature",
"Prolonged early-stage, stable high-frequency oscillations around a single level (cycle-like) that persist for a large portion of the series before any major change."                      : "common feature",
"Emergence of a three-level, multi-plateau structure: an initial high level, a substantial mid-level plateau, and a distinct late negative/low plateau, indicating two interior transitions."                      : "partial-sample feature",
"End-segment settling into a low-variance negative baseline that remains constant to the end, contrasting with earlier positive plateaus."                      : "partial-sample feature",
"Sparse, recurring rectangular bursts: two or more short high-level plateaus embedded in an otherwise near-zero baseline."                      : "common feature",
"Quasi-periodic timing: bursts cluster around mid-series and late-series windows, suggesting regular event-like timing."                      : "partial-sample feature",
"Sharp edges with flat tops: bursts rise and fall abruptly, with a nearly constant high level during each burst."                      : "common feature",
"Absence of long intermediate plateaus: no extended three-level or mid-plateau regime;                       transitions are brief and discrete.                      ": "common feature",
"Mid-series pulse train: a cluster of 4–6 short high-level bursts within the mid-series window, producing a jagged plateau rather than a single flat block."                      : "common feature",
"Nested micro-oscillations on the elevated plateau: rapid, small-amplitude fluctuations riding atop the high level in the mid-series region."                      : "common feature",
"Intermittent micro-dips within the elevated plateau: brief dips below the high level, creating local troughs during the plateau."                      : "common feature",
"Symmetric edge transitions around the mid-series plateau: rise and fall edges are equally steep and of similar duration."                      : "common feature",
"Dense high-variance flicker within a narrow mid-series window, producing a jagged, rapidly oscillating block rather than a clean flat plateau or single pulse."                      : "common feature",
"Multiple distinct burst windows within a single series, separated by longer quiet intervals, rather than a single contiguous burst period."                      : "partial-sample feature",
"Isolated end-of-series spikes that occur abruptly near the final time steps and do not form a sustained high plateau."                      : "partial-sample feature",
"Burst onset time is highly consistent across all three series, occurring around steps 590–610 with a similar duration of 50–60 steps."                      : "partial-sample feature",
"After the burst ends, the signal shows a brief, low-amplitude jitter around zero before fully stabilizing."                      : "partial-sample feature",
"The elevated plateau during the burst is notably flat with minimal within-burst fluctuations, but occasionally exhibits small, step-like sublevels, forming a subdued staircase pattern."                      : "common feature",
"A two-phase burst, with an initial higher-frequency jitter that gradually shifts to a slightly lower-frequency ripple during the mid-burst."                      : "partial-sample feature",
"A two-stage end-phase: after the main burst, a short low-variance lull precedes the final return to baseline."                      : "partial-sample feature",
"Bursts cluster in a late-series window (roughly steps 420–520) across all images, indicating a common event timing."                      : "partial-sample feature",
"Pre-burst gradual ramp into the elevated plateau: a slow, stepwise rise starts before the main burst cluster, rather than an immediate jump to high values."      : "partial-sample feature",
"Brief dips back toward baseline during the elevated window: short, isolated returns toward baseline values occur within the otherwise elevated period."      : "partial-sample feature"
}