{
  "A pronounced, broad negative deflection typically between ~10–45 time steps (most commonly 10–35): large amplitude drop (around -1 to -2.5) with a smooth, wide trough lasting many samples rather than a sharp short spike. The deflection typically begins ~8–20, reaches minimum between ~20–40 and often remains depressed through ~35–45; typical trough duration (below −0.5) >15 samples.": "common feature",
  "A mid-to-late rounded positive plateau/hump from ~45–80 time steps: low-amplitude, slowly varying elevation with small oscillations and a secondary modest peak around 60–75. A pronounced, narrow late terminal spike (e.g., amplitude >1.5 around 80–92) is atypical for class 0 and may indicate class 1.": "common feature",
  "A consistent early positive spike at ~0–6 time steps (amplitude ~1.5–3), a brief R‑like transient that precedes the broad negative trough. The early positive transient is usually brief (width 3–7 samples). An extremely narrow (<4 samples) and very large (>3.0) early spike is more indicative of class 1.": "common feature",
  "Asymmetric trough dynamics: a rapid, steep fall into the negative deflection followed by a slower, smoother recovery back toward the plateau. The trough is smooth and broad (gradual curvature, low high‑frequency content). Sharp, narrow minima or pronounced oscillatory structure inside the trough should lower class-0 confidence. A recovery inflection (a clear kink) around ~36–42 that produces a distinct two-stage slope change is an ambiguous cue and may be present in some class 0 samples, but is more common in class 1; assess together with other features.": "common feature",
  "A low-amplitude, higher-frequency ripple rides on the mid/late plateau (≈45–90), producing small quasi-periodic oscillations (roughly every 3–8 samples) with amplitude ~0.1–0.4 above the plateau.": "common feature",
  "Composite indicators: Class 0 is more likely when the trough is broad (duration >15 samples) and deep (minimum ≤ -1.2) and there is no sharp late terminal spike. Class 1 is more likely when there is a sharp very high early spike (>3) combined with a recovery inflection and a relatively narrow trough (duration <15) or when a final high narrow spike is present.": "common feature",
  "None": "partial-sample feature"
}