{
  "In most series, the baseline is distinctly negative (typically ≈ -1.0 to -0.4) with low baseline variance outside active windows, persisting for many steps—a key discriminator from class 2 which centers near 0. Baseline mean < -0.3 strongly favors class-6 over class-2. Sharp, step-like regime changes occur at active-window boundaries: abrupt jumps from this negative baseline and abrupt returns.": "common feature",
  "Active windows form sustained plateaus lasting roughly 8–25 consecutive time steps (isolated narrow spikes of 1-3 steps are class-2 signature; treat 4-7 step events as ambiguous but look for surrounding texture). These show dense small oscillations—contiguous elevated regions distinguishing them from isolated pulses—with a stable mean (typically ≈ 0.5–1.5) and frequent fast oscillations. In class-6, ≥40–60% of points inside active windows deviate from the local mean by small oscillations (±0.2–0.6), and 1–4 short negative troughs typically occur per plateau.": "common feature",
  "Occasional short high transients (peaks commonly ≤2.5 and only rarely reach 3.0) appear at various positions within active windows, generally lower than class 2 spikes (which often exceed 3.0–3.5). Active-window onsets often include 1–3 step overshoot spikes followed by immediate settling to the plateau mean—if no sustained plateau follows (return to baseline within ≤3 steps), favor class-2.": "common feature",
  "Within active windows, frequent short negative troughs (sharp 1–4 step drops below the mean) create a textured plateau, atypical for class 2. This dense pattern of oscillations and embedded troughs is a key discriminator.": "common feature",
  "The exact start/end times jitter by several steps across series, causing small misalignments. Morning activations sometimes begin with multi-step ramps (2–4 incremental rises) rather than single jumps.": "common feature",
  "Morning periods are typically jagged with higher variance, while evening plateaus are longer/smoother. Many evening plateaus show near-regular ripple (period ≈1–2 steps), stepwise level drops, or slow monotonic decay.": "common feature",
  "Many series end with a sustained negative undershoot (≥3 consecutive steps below baseline mean) after the evening drop—a key discriminator. A burst of variability or large transient often appears immediately before evening step-down. Presence of this undershoot substantially increases class-6 probability.": "common feature",
  "Small pre-evening shoulders (modest elevations at t≈58–68) and baseline micro-spikes (1–5 steps before activations) commonly occur. In ambiguous cases, the combination of baseline mean < -0.3, at least one active window ≥8 steps with >40% internal oscillatory deviations, and sustained evening undershoot/plateau strongly indicates class 6 even with a single narrow spike >3.0.": "common feature",
  "None": "partial-sample feature"
}