{
  "Burst clusters are a defining characteristic: each cluster must contain at least two discernible peaks (main peak and at least one other peak) occurring within a short intra-cluster interval of 4–8 time steps OR one main peak accompanied by at least one sub-peak (local maxima within 1–3 steps before/after the main peak with amplitude ≥20% of the main peak, lasting ≥1 step). Clusters often show multi-peaked structure: a sharp main peak with adjacent smaller precursor/sub-peaks and brief post-peak negative undershoots (excursions below baseline by ≥0.10×main_peak amplitude lasting 1–3 steps). At least one such cluster must be present.": "common feature",
  "Peak asymmetry follows strict quantitative thresholds: rise (steps from baseline to peak) must be ≤1 step, while decay (steps from peak until return to within 10% of baseline) must be ≥2 steps (typically 2–6 steps). At least 40% of detected peaks must meet this rise≤1/decay≥2 criterion. Series where most peaks are uniformly narrow (decay≤1) are atypical and lean toward class-0 unless cluster criteria are strongly satisfied.": "common feature",
  "The baseline is stable and near-constant, with median values typically between -0.10 and 0.00. Persistent baselines below -0.12 suggest class-0 unless cluster morphology overrides. Exact-zero dropouts (≥1 step at precisely zero between pulses) strongly indicate class-0.": "common feature",
  "Peak amplitudes show continuous distributions without strong quantization. Heavy amplitude quantization (>60% of peaks near integer/half-integer values) indicates class-0/class-2.": "common feature",
  "For classification, require ≥2 of these primary criteria: (i) presence of ≥1 qualifying cluster, (ii) ≥40% of peaks with decay≥2 steps, (iii) ≥1 qualifying undershoot (≥0.10×main_peak). If only one criterion is met alongside class-0 hallmarks (twin narrow peaks with second taller, exact-zero dropouts, or strong quantization), prefer class-0.": "common feature",
  "Twin-peak patterns: if two dominant narrow peaks (rise≤1 & decay≤1) are separated by 2–5 steps with the second peak taller, this indicates class-0 unless accompanied by precursor/sub-peaks or undershoots meeting class-5 thresholds.": "common feature",
  "Event timing priors (e.g., mid-day bursts) are weak discriminators and should only be treated as soft supporting evidence.": "common feature",
  "Some series contain very narrow main peaks (decay≤1) within otherwise qualifying clusters, provided the ≥40% decay≥2 threshold is still met.": "partial-sample feature",
  "Timing priors may be absent without precluding class-5 classification if core cluster/shape criteria are satisfied.": "partial-sample feature",
  "Occasional flat apexes (1–2 step plateaus at peak maximum) may occur but carry low diagnostic weight.": "partial-sample feature",
  "Borderline cases with mixed evidence: if only one primary criterion is satisfied and class-0 features (exact-zero dropouts, twin narrow peaks with second taller) are present, class-0 should be preferred. Example: two narrow tall peaks separated by 4 steps with no sub-peaks/undershoots → class-0; two tall peaks with precursor bumps (≥0.20×height) and post-peak undershoot → class-5.": "partial-sample feature"
}