{
  "Burst clusters are a defining characteristic: each cluster must contain at least two discernible peaks (main peak and at least one other peak) occurring within a short intra-cluster interval of 1–8 time steps. Immediate sub-peaks (within 1–3 steps of main peak) require amplitude ≥20% of that cluster's main peak, while extended companions (4–8 steps away) require ≥10% of the cluster's main peak. Clusters often show multi-peaked structure with sharp main peaks, adjacent precursor/sub-peaks, and brief post-peak negative undershoots (excursions below local baseline by ≥0.10×cluster_main_peak amplitude lasting 1–3 steps). At least one qualifying cluster must be present.": "common feature",
  "Peak asymmetry follows quantitative thresholds: rise (steps from local baseline to peak) ≤1 step, while decay (steps from peak until return to within 10% of baseline) typically ≥2 steps. To satisfy asymmetry requirements: let A = peaks in qualifying clusters OR with decay≥2, and B = total non-baseline peaks; require A/B ≥ 0.40 OR (A≥1 with at least one qualifying cluster). A main peak with decay=1 may qualify if directly adjacent (1 step) to a subpeak/shoulder ≥20% of its amplitude.": "common feature",
  "Baseline stability is assessed using median values excluding ±5 steps around peaks, typically between -0.10 and 0.00. Persistent baselines below -0.12 suggest class-0 unless cluster morphology overrides. Exact-zero dropouts (≥1 step at precisely zero) strongly indicate class-0 and override cluster evidence.": "common feature",
  "Peak amplitudes show continuous distributions without strong quantization. Heavy amplitude quantization (>60% of peaks near integer/half-integer values) indicates class-0/class-2.": "common feature",
  "For classification, require ≥2 primary criteria: (i) ≥1 qualifying cluster, (ii) A/B ≥ 0.40 OR (A≥1 with cluster), (iii) ≥1 qualifying undershoot. If only one criterion is met alongside class-0 hallmarks (twin narrow peaks with second taller, exact-zero dropouts, or strong quantization), prefer class-0. Series may contain ≤2 isolated narrow spikes (separated >8 steps from clusters) without precluding class-5 if core criteria are satisfied.": "common feature",
  "Twin-peak patterns: if two dominant narrow peaks (rise≤1 & decay≤1) are separated by 2–5 steps with the second taller, prefer class-0 unless accompanied by precursor/sub-peaks or undershoots meeting class-5 thresholds within the same cluster.": "common feature",
  "Event timing priors (e.g., mid-day bursts) are weak discriminators and treated as soft supporting evidence only when core criteria are borderline.": "common feature",
  "Some series contain very narrow main peaks (decay≤1) within qualifying clusters if adjacent subpeaks/shoulders (≥20% main peak) exist and overall asymmetry requirements (A/B ≥ 0.40) are met.": "partial-sample feature",
  "Timing priors may be absent without precluding class-5 classification if core cluster/shape criteria are satisfied.": "partial-sample feature",
  "Occasional flat apexes (1–2 step plateaus at peak maximum) may occur but carry low diagnostic weight.": "partial-sample feature",
  "Isolated narrow spikes (≤2 instances separated >8 steps from clusters) may coexist with qualifying clusters in some series without affecting classification.": "partial-sample feature",
  "Borderline cases: if only one primary criterion is satisfied alongside class-0 features (exact-zero dropouts, twin narrow peaks with second taller, or strong quantization), prefer class-0. Example: two narrow peaks separated by 4 steps without sub-peaks/undershoots → class-0; two peaks with precursor bumps (≥0.20×cluster_main_peak) and undershoot → class-5.": "partial-sample feature",
  "Amplitude normalization: sub-peak/undershoot thresholds are always relative to local cluster's main peak and local baseline (median excluding ±5 steps around peaks).": "partial-sample feature",
  "When morphology is ambiguous, compute objective features (cluster count, A/B ratio, undershoot presence, quantization score) using defined thresholds for decision support.": "partial-sample feature"
}