{
  "Amplitude envelope modulation: in most series, rapid 16 Hz cycles are embedded in a slow-moving envelope, causing crest heights to rise and fall over the sequence (breathing-like pattern).": "common feature",
  "Cycle asymmetry: individual cycles commonly show steeper rising edges and gentler falling edges, resulting in a skew from perfect symmetry, often with sharper peaks or troughs indicative of non-sinusoidal shapes.": "common feature",
  "Noticeable cycle-to-cycle frequency drift: inter-peak intervals often vary over time, indicating a non-stationary 16 Hz rhythm rather than perfectly periodic cycles, though the drift can be subtle in some cases.": "common feature",
  "Emergent low-frequency envelope modulation (~0.5–1 Hz): a slow waxing and waning of the high-frequency bursts is frequently observed, beyond the fast 16 Hz cycles, but this modulation may coexist with or overlay a dominant rhythm.": "common feature",
  "Tight short-term periodicity: within each burst, inter-peak intervals tend to stay nearly constant, showing stable 16 Hz cycles with minimal intra-burst frequency modulation, yet this stability can accompany other distinguishing features.": "common feature",
  "Intra-sequence tempo non-monotonicity: inter-peak intervals typically show alternating acceleration and deceleration within the burst train, not a single drift, contributing to non-stationarity.": "common feature",
  "Non-sinusoidal waveform shape: in many series, cycles exhibit sharper peaks, more triangular forms, or flattened troughs compared to smooth sinusoidal oscillations, due to the sawing motion.": "common feature",
  "Spectral richness: significant energy is often present in harmonic frequencies (e.g., 32 Hz, 48 Hz) relative to the fundamental, reflecting the non-sinusoidal nature and higher-harmonic content.": "common feature",
  "Cycle-to-cycle amplitude variability: amplitudes of consecutive cycles may show modest fluctuations even when the rhythm appears regular, with standard deviation of period or skewness of rise/fall times providing discrimination.": "common feature",
  "Cross-axis coordination: the sawing motion typically involves specific phase relationships or correlated changes across the x, y, z axes, such as simultaneous spikes, anti-phase movements, or axis-specific abrupt shifts that distinguish it from other activities.": "common feature",
  "Clear two-phase progression: in some series, persistent high-frequency oscillations are followed by an abrupt transition to a near-flat baseline (~1.0), indicating cessation of activity.": "partial-sample feature",
  "Within active segments, crest heights exhibit progressive damping over time in some series, showing a decaying peak amplitude before the plateau.": "partial-sample feature",
  "Nested slow envelope: a secondary, slower modulation (~0.2–0.3 Hz) modulates the 16 Hz bursts in some images, creating a two-tier amplitude pattern across the 13 s.": "partial-sample feature",
  "Abrupt mean shifts or baseline changes: in certain series, there are sudden changes in the signal mean, possibly corresponding to the start or end of sawing strokes, though not always present.": "partial-sample feature",
  "Variance drift: the variance of the signal may increase or decrease gradually over time in some windows, reflecting changes in motion intensity or non-stationarity.": "partial-sample feature",
  "End-effects: some series display increased high-frequency jitter or noise towards the end of the sequence, though this is not consistently observed.": "partial-sample feature",
  "Composite non-stationarity cues: in a subset of series, small but detectable mean drifts, baseline shifts, or changes in variance across time occur, often combined with cycle-to-cycle variability metrics to enhance discrimination.": "partial-sample feature"
}