{
  "Dominant single broad inverted trough with the trough centered around 400–480 time steps: slow rise to a small positive peak (crest typically occurring between 180–300 time steps), rapid descent into a wide negative valley (commonly reaching about -1.4 to -2.0), then gradual recovery toward baseline. The trough magnitude is typically about 1.5–2 times the positive crest amplitude.": "common feature",
  "Low-frequency, very smooth morphology with asymmetric slopes — the downward transition is steeper than the recovery — characterized by minimal quasi-periodic/high-frequency power (after mild smoothing, residual fluctuations are small, RMS << 0.15), lacking the persistent post-trough ripples common in class 2.": "common feature",
  "Positive crest and shoulder reliably occur early (around 180–300 time steps), so the rapid descent begins well before the exact mid-point, producing a consistently front-loaded peak timing. The crest is most often a single broad unimodal peak or has a secondary shoulder substantially smaller (<10–20% of primary crest amplitude), unlike class 2's frequent double-peaked morphology.": "common feature",
  "Strong piecewise monotonic structure: largely uninterrupted early rise, long descent, and steady monotonic recovery with minimal deviations. Recovery is typically linear/concave without accelerating terminal bumps or pronounced late positive excursions.": "common feature",
  "Negative trough has larger absolute magnitude than preceding positive crest — downward excursion deeper than initial rise is tall.": "common feature",
  "Features indicating non-class-0: persistent quasi-regular ripples (amplitude > ~0.1), distinct mid-trough rebounds, pronounced double-peaked humps, or accelerating late recoveries suggest class 2.": "common feature",
  "Summary: class-0 = single broad unimodal pre-trough crest (~180–300), very smooth steep descent to deep trough (~400–480, ≈ −1.4 to −2.0), then long steady monotonic recovery with minimal oscillation.": "common feature",
  "Broad flattened trough bottom: when present, the deep negative valley contains an extended near-constant low plateau lasting roughly 20–80 time steps centered near the trough minimum, rather than brief notches or mid-trough rebounds.": "partial-sample feature"
}